XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_led.h
/**
  *******************************************************************************************************
  * @file    fm33fl0xx_fl_led.h
  * @author  FMSH Application Team
  * @brief   Head file of LED FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FL0XX_FL_LED_H
#define __FM33FL0XX_FL_LED_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lf0xx_fl_def.h"
/** @addtogroup FM33FL0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup LED_FL_ES_INIT LED Exported Init structures
  * @{
  */

/**
  * @brief FL LED Init Sturcture definition
  */
typedef struct
{
    /* COM个数 */
    uint32_t COMxNum;
    /* 空闲时com口状态 */
    uint32_t comFloat;
    /* com 极性 */
    uint32_t comPolarity;
    /* DIG 极性 */
    uint32_t digPolarity;
    /* pwm使能 */
    uint32_t pwmEn;
    /* pwm 周期 */
    uint32_t pwmPeriod;
    /* scan 预分频 */
    uint32_t scanPres;
    /* 相移 */
    uint32_t phs;  
    /* 行切换空闲时间*/
    uint32_t lswBlank;  
    /* 时钟源*/
    uint32_t clkSource; 
    /* 时钟分频系数*/
    uint32_t Prescaler;
    
} FL_LED_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup LED_FL_Exported_Constants LED Exported Constants
  * @{
  */

#define    LED_CR_DDMAEN_Pos                                      (3U)
#define    LED_CR_DDMAEN_Msk                                      (0x1U << LED_CR_DDMAEN_Pos)
#define    LED_CR_DDMAEN                                          LED_CR_DDMAEN_Msk

#define    LED_CR_PDMAEN_Pos                                      (2U)
#define    LED_CR_PDMAEN_Msk                                      (0x1U << LED_CR_PDMAEN_Pos)
#define    LED_CR_PDMAEN                                          LED_CR_PDMAEN_Msk

#define    LED_CR_PWMEN_Pos                                       (1U)
#define    LED_CR_PWMEN_Msk                                       (0x1U << LED_CR_PWMEN_Pos)
#define    LED_CR_PWMEN                                           LED_CR_PWMEN_Msk

#define    LED_CR_LEDEN_Pos                                       (0U)
#define    LED_CR_LEDEN_Msk                                       (0x1U << LED_CR_LEDEN_Pos)
#define    LED_CR_LEDEN                                           LED_CR_LEDEN_Msk

#define    LED_CFGR_PHS_Pos                                       (24U)
#define    LED_CFGR_PHS_Msk                                       (0xffU << LED_CFGR_PHS_Pos)
#define    LED_CFGR_PHS                                           LED_CFGR_PHS_Msk

#define    LED_CFGR_LSW_BLKT_Pos                                  (19U)
#define    LED_CFGR_LSW_BLKT_Msk                                  (0x1fU << LED_CFGR_LSW_BLKT_Pos)
#define    LED_CFGR_LSW_BLKT                                      LED_CFGR_LSW_BLKT_Msk

#define    LED_CFGR_COM_FLT_Pos                                   (18U)
#define    LED_CFGR_COM_FLT_Msk                                   (0x1U << LED_CFGR_COM_FLT_Pos)
#define    LED_CFGR_COM_FLT                                       LED_CFGR_COM_FLT_Msk

#define    LED_CFGR_DIG_POLAR_Pos                                 (17U)
#define    LED_CFGR_DIG_POLAR_Msk                                 (0x1U << LED_CFGR_DIG_POLAR_Pos)
#define    LED_CFGR_DIG_POLAR                                     LED_CFGR_DIG_POLAR_Msk

#define    LED_CFGR_COM_POLAR_Pos                                 (16U)
#define    LED_CFGR_COM_POLAR_Msk                                 (0x1U << LED_CFGR_COM_POLAR_Pos)
#define    LED_CFGR_COM_POLAR                                     LED_CFGR_COM_POLAR_Msk

#define    LED_CFGR_COM_LENGTH_Pos                                (8U)
#define    LED_CFGR_COM_LENGTH_Msk                                (0xffU << LED_CFGR_COM_LENGTH_Pos)
#define    LED_CFGR_COM_LENGTH                                    LED_CFGR_COM_LENGTH_Msk

#define    LED_CFGR_SCAN_PRES_Pos                                 (4U)
#define    LED_CFGR_SCAN_PRES_Msk                                 (0xfU << LED_CFGR_SCAN_PRES_Pos)
#define    LED_CFGR_SCAN_PRES                                     LED_CFGR_SCAN_PRES_Msk

#define    LED_CFGR_MAX_LINE_Pos                                  (0U)
#define    LED_CFGR_MAX_LINE_Msk                                  (0xfU << LED_CFGR_MAX_LINE_Pos)
#define    LED_CFGR_MAX_LINE                                      LED_CFGR_MAX_LINE_Msk

#define    LED_IER_FEIE_Pos                                       (1U)
#define    LED_IER_FEIE_Msk                                       (0x1U << LED_IER_FEIE_Pos)
#define    LED_IER_FEIE                                           LED_IER_FEIE_Msk

#define    LED_IER_LSIE_Pos                                       (0U)
#define    LED_IER_LSIE_Msk                                       (0x1U << LED_IER_LSIE_Pos)
#define    LED_IER_LSIE                                           LED_IER_LSIE_Msk

#define    LED_ISR_FEIF_Pos                                       (1U)
#define    LED_ISR_FEIF_Msk                                       (0x1U << LED_ISR_FEIF_Pos)
#define    LED_ISR_FEIF                                           LED_ISR_FEIF_Msk

