XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_led.h
#define    LED_ISR_DONIF_Pos                                      (0U)
#define    LED_ISR_DONIF_Msk                                      (0x1U << LED_ISR_DONIF_Pos)
#define    LED_ISR_DONIF                                          LED_ISR_DONIF_Msk

#define    LED_PWMCRA_CR3_Pos                                     (24U)
#define    LED_PWMCRA_CR3_Msk                                     (0xffU << LED_PWMCRA_CR3_Pos)
#define    LED_PWMCRA_CR3                                         LED_PWMCRA_CR3_Msk

#define    LED_PWMCRA_CR2_Pos                                     (16U)
#define    LED_PWMCRA_CR2_Msk                                     (0xffU << LED_PWMCRA_CR2_Pos)
#define    LED_PWMCRA_CR2                                         LED_PWMCRA_CR2_Msk

#define    LED_PWMCRA_CR1_Pos                                     (8U)
#define    LED_PWMCRA_CR1_Msk                                     (0xffU << LED_PWMCRA_CR1_Pos)
#define    LED_PWMCRA_CR1                                         LED_PWMCRA_CR1_Msk

#define    LED_PWMCRA_CR0_Pos                                     (0U)
#define    LED_PWMCRA_CR0_Msk                                     (0xffU << LED_PWMCRA_CR0_Pos)
#define    LED_PWMCRA_CR0                                         LED_PWMCRA_CR0_Msk

#define    LED_PWMCRB_CR7_Pos                                     (24U)
#define    LED_PWMCRB_CR7_Msk                                     (0xffU << LED_PWMCRB_CR7_Pos)
#define    LED_PWMCRB_CR7                                         LED_PWMCRB_CR7_Msk

#define    LED_PWMCRB_CR6_Pos                                     (16U)
#define    LED_PWMCRB_CR6_Msk                                     (0xffU << LED_PWMCRB_CR6_Pos)
#define    LED_PWMCRB_CR6                                         LED_PWMCRB_CR6_Msk

#define    LED_PWMCRB_CR5_Pos                                     (8U)
#define    LED_PWMCRB_CR5_Msk                                     (0xffU << LED_PWMCRB_CR5_Pos)
#define    LED_PWMCRB_CR5                                         LED_PWMCRB_CR5_Msk

#define    LED_PWMCRB_CR4_Pos                                     (0U)
#define    LED_PWMCRB_CR4_Msk                                     (0xffU << LED_PWMCRB_CR4_Pos)
#define    LED_PWMCRB_CR4                                         LED_PWMCRB_CR4_Msk

#define    LED_PWMCRC_CR11_Pos                                    (24U)
#define    LED_PWMCRC_CR11_Msk                                    (0xffU << LED_PWMCRC_CR11_Pos)
#define    LED_PWMCRC_CR11                                        LED_PWMCRC_CR11_Msk

#define    LED_PWMCRC_CR10_Pos                                    (16U)
#define    LED_PWMCRC_CR10_Msk                                    (0xffU << LED_PWMCRC_CR10_Pos)
#define    LED_PWMCRC_CR10                                        LED_PWMCRC_CR10_Msk

#define    LED_PWMCRC_CR9_Pos                                     (8U)
#define    LED_PWMCRC_CR9_Msk                                     (0xffU << LED_PWMCRC_CR9_Pos)
#define    LED_PWMCRC_CR9                                         LED_PWMCRC_CR9_Msk

#define    LED_PWMCRC_CR8_Pos                                     (0U)
#define    LED_PWMCRC_CR8_Msk                                     (0xffU << LED_PWMCRC_CR8_Pos)
#define    LED_PWMCRC_CR8                                         LED_PWMCRC_CR8_Msk

#define    LED_PWMCRD_CR15_Pos                                    (24U)
#define    LED_PWMCRD_CR15_Msk                                    (0xffU << LED_PWMCRD_CR15_Pos)
#define    LED_PWMCRD_CR15                                        LED_PWMCRD_CR15_Msk

#define    LED_PWMCRD_CR14_Pos                                    (16U)
#define    LED_PWMCRD_CR14_Msk                                    (0xffU << LED_PWMCRD_CR14_Pos)
#define    LED_PWMCRD_CR14                                        LED_PWMCRD_CR14_Msk

#define    LED_PWMCRD_CR13_Pos                                    (8U)
#define    LED_PWMCRD_CR13_Msk                                    (0xffU << LED_PWMCRD_CR13_Pos)
#define    LED_PWMCRD_CR13                                        LED_PWMCRD_CR13_Msk

#define    LED_PWMCRD_CR12_Pos                                    (0U)
#define    LED_PWMCRD_CR12_Msk                                    (0xffU << LED_PWMCRD_CR12_Pos)
#define    LED_PWMCRD_CR12                                        LED_PWMCRD_CR12_Msk

#define    LED_DOT_DATA_Pos                                       (0U)
#define    LED_DOT_DATA_Msk                                       (0x0000ffffU << LED_DOT_DATA_Pos)
#define    LED_DOT_DATA                                           LED_DOT_DATA_Msk

#define    LED_DMACR_DDTRIG_Pos                                   (8U)
#define    LED_DMACR_DDTRIG_Msk                                   (0x1U << LED_DMACR_DDTRIG_Pos)
#define    LED_DMACR_DDTRIG                                       LED_DMACR_DDTRIG_Msk

#define    LED_DMACR_DOTDR_LEN_Pos                                (4U)
#define    LED_DMACR_DOTDR_LEN_Msk                                (0xfU << LED_DMACR_DOTDR_LEN_Pos)
#define    LED_DMACR_DOTDR_LEN                                    LED_DMACR_DOTDR_LEN_Msk

#define    LED_DMACR_PWMCR_LEN_Pos                                (0U)
#define    LED_DMACR_PWMCR_LEN_Msk                                (0x7U << LED_DMACR_PWMCR_LEN_Pos)
#define    LED_DMACR_PWMCR_LEN                                    LED_DMACR_PWMCR_LEN_Msk

#define    LED_DPCAR_ADDR_Pos                                     (0U)
#define    LED_DPCAR_ADDR_Msk                                     (0xffffffffU << LED_DPCAR_ADDR_Pos)
#define    LED_DPCAR_ADDR                                         LED_DPCAR_ADDR_Msk

#define    LED_DDRAR_ADDR_Pos                                     (0U)
#define    LED_DDRAR_ADDR_Msk                                     (0xffffffffU << LED_DDRAR_ADDR_Pos)
#define    LED_DDRAR_ADDR                                         LED_DDRAR_ADDR_Msk

#define    LED_CCOM_ACT_COM_Pos                                   (0U)
#define    LED_CCOM_ACT_COM_Msk                                   (0x3ffU << LED_CCOM_ACT_COM_Pos)
#define    LED_CCOM_ACT_COM                                       LED_CCOM_ACT_COM_Msk



#define    FL_LED_DOT_REG0                                        (0x0U << 0U)
#define    FL_LED_DOT_REG1                                        (0x1U << 0U)
#define    FL_LED_DOT_REG2                                        (0x2U << 0U)
#define    FL_LED_DOT_REG3                                        (0x3U << 0U)
#define    FL_LED_DOT_REG4                                        (0x4U << 0U)
#define    FL_LED_DOT_REG5                                        (0x5U << 0U)
#define    FL_LED_DOT_REG6                                        (0x6U << 0U)
#define    FL_LED_DOT_REG7                                        (0x7U << 0U)
#define    FL_LED_DOT_REG8                                        (0x8U << 0U)
#define    FL_LED_DOT_REG9                                        (0x9U << 0U)



