XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_led.h
#define    FL_LED_COM_IDLE_STATUS_OUTPUT                          (0x0U << LED_CFGR_COM_FLT_Pos)
#define    FL_LED_COM_IDLE_STATUS_FLOAT                           (0x1U << LED_CFGR_COM_FLT_Pos)


#define    FL_LED_DIG_OUTPUT_POLARITY_NORMAL                          (0x0U << LED_CFGR_DIG_POLAR_Pos)
#define    FL_LED_DIG_OUTPUT_POLARITY_INVERT                          (0x1U << LED_CFGR_DIG_POLAR_Pos)


#define    FL_LED_COM_OUTPUT_POLARITY_NORMAL                          (0x0U << LED_CFGR_COM_POLAR_Pos)
#define    FL_LED_COM_OUTPUT_POLARITY_INVERT                          (0x1U << LED_CFGR_COM_POLAR_Pos)


#define    FL_LED_MAX_LINE_COM0                                   (0x1U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_1                                 (0x2U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_2                                 (0x3U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_3                                 (0x4U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_4                                 (0x5U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_5                                 (0x6U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_6                                 (0x7U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_7                                 (0x8U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_8                                 (0x9U << LED_CFGR_MAX_LINE_Pos)
#define    FL_LED_MAX_LINE_COM0_9                                 (0xaU << LED_CFGR_MAX_LINE_Pos)

#define    FL_LED_REQUEST_BY_FRAME_END                            (0x0U << LED_DMACR_DDTRIG_Pos)
#define    FL_LED_REQUEST_BY_TRIG_SYNC                            (0x1U << LED_DMACR_DDTRIG_Pos)


#define    FL_LED_DOT_DR0                                         (0x1U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_1                                       (0x2U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_2                                       (0x3U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_3                                       (0x4U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_4                                       (0x5U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_5                                       (0x6U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_6                                       (0x7U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_7                                       (0x8U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_8                                       (0x9U << LED_DMACR_DOTDR_LEN_Pos)
#define    FL_LED_DOT_DR0_9                                       (0xaU << LED_DMACR_DOTDR_LEN_Pos)

#define    FL_LED_PWM_CRA                                         (0x1U << LED_DMACR_PWMCR_LEN_Pos)
#define    FL_LED_PWM_CRA_B                                       (0x2U << LED_DMACR_PWMCR_LEN_Pos)
#define    FL_LED_PWM_CRA_C                                       (0x3U << LED_DMACR_PWMCR_LEN_Pos)
#define    FL_LED_PWM_CRA_D                                       (0x4U << LED_DMACR_PWMCR_LEN_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup LED_FL_Exported_Functions LED Exported Functions
  * @{
  */

/**
  * @brief    Enable LED DotDMA
  * @rmtoll   CR    DDMAEN    FL_LED_EnableDotDmaEn
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_EnableDotDmaEn(LED_Type* LEDx)
{
    SET_BIT(LEDx->CR, LED_CR_DDMAEN_Msk);
}

/**
  * @brief    Disable LED DotDMA
  * @rmtoll   CR    DDMAEN    FL_LED_DisableDotDmaEn
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_DisableDotDmaEn(LED_Type* LEDx)
{
    CLEAR_BIT(LEDx->CR, LED_CR_DDMAEN_Msk);
}

/**
  * @brief    Get LED DotDMA State
  * @rmtoll   CR    DDMAEN    FL_LED_IsEnabledDotDmaEn
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsEnabledDotDmaEn(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CR, LED_CR_DDMAEN_Msk) == LED_CR_DDMAEN_Msk);
}

/**
  * @brief    Enable LED PWM DMA
  * @rmtoll   CR    PDMAEN    FL_LED_EnablePwmDmaEn
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_EnablePwmDmaEn(LED_Type* LEDx)
{
    SET_BIT(LEDx->CR, LED_CR_PDMAEN_Msk);
}

/**
  * @brief    Disable LED PWM DMA
  * @rmtoll   CR    PDMAEN    FL_LED_DisablePwmDmaEn
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_DisablePwmDmaEn(LED_Type* LEDx)
{
    CLEAR_BIT(LEDx->CR, LED_CR_PDMAEN_Msk);
}

/**
  * @brief    Get LED Blink PWM DMA
  * @rmtoll   CR    PDMAEN    FL_LED_IsEnabledPwmDmaEn
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsEnabledPwmDmaEn(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CR, LED_CR_PDMAEN_Msk) == LED_CR_PDMAEN_Msk);
}

/**
  * @brief    Enable LED PWM Dimming
  * @rmtoll   CR    PWMEN    FL_LED_EnablePwmDimmingEn
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_EnablePwmDimmingEn(LED_Type* LEDx)
{
    SET_BIT(LEDx->CR, LED_CR_PWMEN_Msk);
}

/**
  * @brief    Disable LED PWM Dimming
  * @rmtoll   CR    PWMEN    FL_LED_DisablePwmDimmingEn
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_DisablePwmDimmingEn(LED_Type* LEDx)
{
    CLEAR_BIT(LEDx->CR, LED_CR_PWMEN_Msk);
}

/**
  * @brief    Get LED PWM Dimming State
  * @rmtoll   CR    PWMEN    FL_LED_IsEnabledPwmDimmingEn
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsEnabledPwmDimmingEn(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CR, LED_CR_PWMEN_Msk) == LED_CR_PWMEN_Msk);
}

/**
  * @brief    Enable LED 
  * @rmtoll   CR    LEDEN    FL_LED_Enable
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_Enable(LED_Type* LEDx)
{
    SET_BIT(LEDx->CR, LED_CR_LEDEN_Msk);
}

/**
  * @brief    Disable LED 
  * @rmtoll   CR    LEDEN    FL_LED_Disable
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_Disable(LED_Type* LEDx)
{
    CLEAR_BIT(LEDx->CR, LED_CR_LEDEN_Msk);
}

/**
  * @brief    Get LED State
  * @rmtoll   CR    LEDEN    FL_LED_IsEnabled
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsEnabled(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CR, LED_CR_LEDEN_Msk) == LED_CR_LEDEN_Msk);
}

/**
  * @brief    Set LED PHS Time
  * @rmtoll   CFGR    PHS    FL_LED_SetPHS
  * @param    LEDx LED instance
  * @param    phs This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetPHS(LED_Type* LEDx, uint32_t phs)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_PHS_Msk, phs<<24);
}

/**
  * @brief    Get LED PHS Time
  * @rmtoll   CFGR    PHS    FL_LED_GetPHS
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetPHS(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_PHS_Msk));
}

/**
  * @brief    Set Line Switch Blank Time
  * @rmtoll   CFGR    LSW_BLKT    FL_LED_SetLineSwitchBlankTime
  * @param    LEDx LED instance
  * @param    blankTimeUs This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetLineSwitchBlankTime(LED_Type* LEDx, uint32_t blankTimeUs)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_LSW_BLKT_Msk, blankTimeUs<<19);
}

/**
  * @brief    Get Line Switch Blank Time
  * @rmtoll   CFGR    LSW_BLKT    FL_LED_GetLineSwitchBlankTime
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetLineSwitchBlankTime(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_LSW_BLKT_Msk));
}

/**
  * @brief    Set COM Idle Stauts
  * @rmtoll   CFGR    COM_FLT    FL_LED_SetComIdleStauts
  * @param    LEDx LED instance
  * @param    status This parameter can be one of the following values:
  *           @arg @ref FL_LED_COM_IDLE_STATUS_OUTPUT
  *           @arg @ref FL_LED_COM_IDLE_STATUS_FLOAT
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetComIdleStauts(LED_Type* LEDx, uint32_t status)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_COM_FLT_Msk, status);
}

/**
  * @brief    Get COM  Idle Stauts
  * @rmtoll   CFGR    COM_FLT    FL_LED_GetComIdleStauts
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_COM_IDLE_STATUS_OUTPUT
  *           @arg @ref FL_LED_COM_IDLE_STATUS_FLOAT
  */
__STATIC_INLINE uint32_t FL_LED_GetComIdleStauts(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_COM_FLT_Msk));
}

/**
  * @brief    Set LED Dig Pin Output Polarity
  * @rmtoll   CFGR    DIG_POLAR    FL_LED_SetSegDigOutputPolarity
  * @param    LEDx LED instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_LED_OUTPUT_POLARITY_NORMAL
  *           @arg @ref FL_LED_OUTPUT_POLARITY_INVERT
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDigOutputPolarity(LED_Type* LEDx, uint32_t polarity)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_DIG_POLAR_Msk, polarity);
}

/**
  * @brief    Get LED Dig Pin Output Polarity
  * @rmtoll   CFGR    DIG_POLAR    FL_LED_GetSegDigOutputPolarity
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_OUTPUT_POLARITY_NORMAL
  *           @arg @ref FL_LED_OUTPUT_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_LED_GetDigOutputPolarity(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_DIG_POLAR_Msk));
}

/**
  * @brief    Set LED Com Pin Output Polarity
  * @rmtoll   CFGR    COM_POLAR    FL_LED_SetSegComOutputPolarity
  * @param    LEDx LED instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_LED_OUTPUT_POLARITY_NORMAL
  *           @arg @ref FL_LED_OUTPUT_POLARITY_INVERT
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetComOutputPolarity(LED_Type* LEDx, uint32_t polarity)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_COM_POLAR_Msk, polarity);
}

/**
  * @brief    Get LED Com Pin Output Polarity
  * @rmtoll   CFGR    COM_POLAR    FL_LED_GetSegComOutputPolarity
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_OUTPUT_POLARITY_NORMAL
  *           @arg @ref FL_LED_OUTPUT_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_LED_GetComOutputPolarity(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_COM_POLAR_Msk));
}

/**
  * @brief    Set LED Com Length Time
  * @rmtoll   CFGR    COM_LENGTH    FL_LED_SetComLength
  * @param    LEDx LED instance
  * @param    comLength This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetComLength(LED_Type* LEDx, uint32_t comLength)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_COM_LENGTH_Msk, comLength<<8);
}

/**
  * @brief    Get LED Com Length Time
  * @rmtoll   CFGR    COM_LENGTH    FL_LED_GetComLength
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetComLength(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_COM_LENGTH_Msk));
}

/**
  * @brief    Set LED Scan Prescaler Time
  * @rmtoll   CFGR    SCAN_PRES    FL_LED_SetScanPrescaler
  * @param    LEDx LED instance
  * @param    Prescaler This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetScanPrescaler(LED_Type* LEDx, uint32_t Prescaler)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_SCAN_PRES_Msk, Prescaler<<4);
}

/**
  * @brief    Get LED Scan Prescaler Time
  * @rmtoll   CFGR    SCAN_PRES    FL_LED_GetScanPrescaler
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetScanPrescaler(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_SCAN_PRES_Msk));
}

/**
  * @brief    Set Max Line
  * @rmtoll   CFGR    MAX_LINE    FL_LED_SetMaxLine
  * @param    LEDx LED instance
  * @param    maxLine This parameter can be one of the following values:
  *           @arg @ref FL_LED_MAX_LINE_COM0
  *           @arg @ref FL_LED_MAX_LINE_COM0_1
  *           @arg @ref FL_LED_MAX_LINE_COM0_2
  *           @arg @ref FL_LED_MAX_LINE_COM0_3
  *           @arg @ref FL_LED_MAX_LINE_COM0_4
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetMaxLine(LED_Type* LEDx, uint32_t maxLine)
{
    MODIFY_REG(LEDx->CFGR, LED_CFGR_MAX_LINE_Msk, maxLine);
}

/**
  * @brief    Get Max Line
  * @rmtoll   CFGR    MAX_LINE    FL_LED_GetMaxLine
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_MAX_LINE_COM0
  *           @arg @ref FL_LED_MAX_LINE_COM0_1
  *           @arg @ref FL_LED_MAX_LINE_COM0_2
  *           @arg @ref FL_LED_MAX_LINE_COM0_3
  *           @arg @ref FL_LED_MAX_LINE_COM0_4
  *           @arg @ref FL_LED_MAX_LINE_COM0_5
  *           @arg @ref FL_LED_MAX_LINE_COM0_6
  *           @arg @ref FL_LED_MAX_LINE_COM0_7
  *           @arg @ref FL_LED_MAX_LINE_COM0_8
  *           @arg @ref FL_LED_MAX_LINE_COM0_9
  */
__STATIC_INLINE uint32_t FL_LED_GetMaxLine(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CFGR, LED_CFGR_MAX_LINE_Msk));
}

/**
  * @brief    Enable LED Frame End IRQ
  * @rmtoll   IER    FEIE    FL_LED_EnableIT_FrameEnd
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_EnableIT_FrameEnd(LED_Type* LEDx)
{
    SET_BIT(LEDx->IER, LED_IER_FEIE_Msk);
}

/**
  * @brief    Disable LED Frame End IRQ
  * @rmtoll   IER    FEIE    FL_LED_DisableIT_FrameEnd
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_DisableIT_FrameEnd(LED_Type* LEDx)
{
    CLEAR_BIT(LEDx->IER, LED_IER_FEIE_Msk);
}

/**
  * @brief    Getable LED Frame End IRQ
  * @rmtoll   IER    FEIE    FL_LED_IsEnabledIT_FrameEnd
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsEnabledIT_FrameEnd(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->IER, LED_IER_FEIE_Msk) == LED_IER_FEIE_Msk);
}

/**
  * @brief    Enable LED Line Switch IRQ
  * @rmtoll   IER    LSIE    FL_LED_EnableIT_LineSwitch
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_EnableIT_LineSwitch(LED_Type* LEDx)
{
    SET_BIT(LEDx->IER, LED_IER_LSIE_Msk);
}

/**
  * @brief    Disable LED Line Switch IRQ
  * @rmtoll   IER    LSIE    FL_LED_DisableIT_LineSwitch
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_DisableIT_LineSwitch(LED_Type* LEDx)
{
    CLEAR_BIT(LEDx->IER, LED_IER_LSIE_Msk);
}

/**
  * @brief    Getable LED Line Switch IRQ
  * @rmtoll   IER    LSIE    FL_LED_IsEnabledIT_LineSwitch
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsEnabledIT_LineSwitch(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->IER, LED_IER_LSIE_Msk) == LED_IER_LSIE_Msk);
}

/**
  * @brief    Get LED Frame End Flag
  * @rmtoll   ISR    FEIF    FL_LED_IsActiveFlag_FrameEnd
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsActiveFlag_FrameEnd(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->ISR, LED_ISR_FEIF_Msk) == (LED_ISR_FEIF_Msk));
}

/**
  * @brief    Clear LED Frame EndF Flag
  * @rmtoll   ISR    FEIF    FL_LED_ClearFlag_FrameEnd
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_ClearFlag_FrameEnd(LED_Type* LEDx)
{
    WRITE_REG(LEDx->ISR, LED_ISR_FEIF_Msk);
}

/**
  * @brief    Get LED Line Switch Flag
  * @rmtoll   ISR    DONIF    FL_LED_IsActiveFlag_LineSwitch
  * @param    LEDx LED instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_LED_IsActiveFlag_LineSwitch(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->ISR, LED_ISR_DONIF_Msk) == (LED_ISR_DONIF_Msk));
}

/**
  * @brief    Clear LED Line Switch Flag
  * @rmtoll   ISR    DONIF    FL_LED_ClearFlag_LineSwitch
  * @param    LEDx LED instance
  * @retval   None
  */
__STATIC_INLINE void FL_LED_ClearFlag_LineSwitch(LED_Type* LEDx)
{
    WRITE_REG(LEDx->ISR, LED_ISR_DONIF_Msk);
}

/**
  * @brief    Set LED Dig3 PWM
  * @rmtoll   PWMCRA    CR3    FL_LED_SetDig3PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig3PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRA, LED_PWMCRA_CR3_Msk, cr<<24);
}

/**
  * @brief    Get LED Dig3 PWM
  * @rmtoll   PWMCRA    CR3    FL_LED_GetDig3PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig3PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRA, LED_PWMCRA_CR3_Msk));
}

/**
  * @brief    Set LED Dig2 PWM
  * @rmtoll   PWMCRA    CR2    FL_LED_SetDig2PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig2PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRA, LED_PWMCRA_CR2_Msk, cr<<16);
}

/**
  * @brief    Get LED Dig2 PWM
  * @rmtoll   PWMCRA    CR2    FL_LED_GetDig2PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig2PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRA, LED_PWMCRA_CR2_Msk));
}

/**
  * @brief    Set LED Dig1 PWM
  * @rmtoll   PWMCRA    CR1    FL_LED_SetDig1PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig1PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRA, LED_PWMCRA_CR1_Msk, cr<<8);
}

/**
  * @brief    Get LED Dig1 PWM
  * @rmtoll   PWMCRA    CR1    FL_LED_GetDig1PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig1PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRA, LED_PWMCRA_CR1_Msk));
}

/**
  * @brief    Set LED Dig0 PWM
  * @rmtoll   PWMCRA    CR0    FL_LED_SetDig0PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig0PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRA, LED_PWMCRA_CR0_Msk, cr<<0);
}

/**
  * @brief    Get LED Dig0 PWM
  * @rmtoll   PWMCRA    CR0    FL_LED_GetDig0PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig0PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRA, LED_PWMCRA_CR0_Msk));
}

/**
  * @brief    Set LED Dig7 PWM
  * @rmtoll   PWMCRB    CR7    FL_LED_SetDig7PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig7PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRB, LED_PWMCRB_CR7_Msk, cr<<24);
}

/**
  * @brief    Get LED Dig7 PWM
  * @rmtoll   PWMCRB    CR7    FL_LED_GetDig7PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig7PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRB, LED_PWMCRB_CR7_Msk));
}

/**
  * @brief    Set LED Dig6 PWM
  * @rmtoll   PWMCRB    CR6    FL_LED_SetDig6PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig6PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRB, LED_PWMCRB_CR6_Msk, cr<<16);
}

/**
  * @brief    Get LED Dig6 PWM
  * @rmtoll   PWMCRB    CR6    FL_LED_GetDig6PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig6PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRB, LED_PWMCRB_CR6_Msk));
}

/**
  * @brief    Set LED Dig5 PWM
  * @rmtoll   PWMCRB    CR5    FL_LED_SetDig5PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig5PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRB, LED_PWMCRB_CR5_Msk, cr<<8);
}

/**
  * @brief    Get LED Dig5 PWM
  * @rmtoll   PWMCRB    CR5    FL_LED_GetDig5PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig5PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRB, LED_PWMCRB_CR5_Msk));
}

/**
  * @brief    Set LED Dig4 PWM
  * @rmtoll   PWMCRB    CR4    FL_LED_SetDig4PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig4PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRB, LED_PWMCRB_CR4_Msk, cr<<0);
}

/**
  * @brief    Get LED Dig4 PWM
  * @rmtoll   PWMCRB    CR4    FL_LED_GetDig4PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig4PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRB, LED_PWMCRB_CR4_Msk));
}

/**
  * @brief    Set LED Dig11 PWM
  * @rmtoll   PWMCRC    CR11    FL_LED_SetDig11PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig11PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRC, LED_PWMCRC_CR11_Msk, cr<<24);
}

/**
  * @brief    Get LED Dig11 PWM
  * @rmtoll   PWMCRC    CR11    FL_LED_GetDig11PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig11PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRC, LED_PWMCRC_CR11_Msk));
}

/**
  * @brief    Set LED Dig10 PWM
  * @rmtoll   PWMCRC    CR10    FL_LED_SetDig10PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig10PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRC, LED_PWMCRC_CR10_Msk, cr<<16);
}

/**
  * @brief    Get LED Dig10 PWM
  * @rmtoll   PWMCRC    CR10    FL_LED_GetDig10PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig10PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRC, LED_PWMCRC_CR10_Msk));
}

/**
  * @brief    Set LED Dig9 PWM
  * @rmtoll   PWMCRC    CR9    FL_LED_SetDig9PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig9PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRC, LED_PWMCRC_CR9_Msk, cr<<8);
}

/**
  * @brief    Get LED Dig9 PWM
  * @rmtoll   PWMCRC    CR9    FL_LED_GetDig9PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig9PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRC, LED_PWMCRC_CR9_Msk));
}

