XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_led.h
/**
  * @brief    Set LED Dig8 PWM
  * @rmtoll   PWMCRC    CR8    FL_LED_SetDig8PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig8PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRC, LED_PWMCRC_CR8_Msk, cr<<0);
}

/**
  * @brief    Get LED Dig8 PWM
  * @rmtoll   PWMCRC    CR8    FL_LED_GetDig8PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig8PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRC, LED_PWMCRC_CR8_Msk));
}

/**
  * @brief    Set LED Dig15 PWM
  * @rmtoll   PWMCRD    CR15    FL_LED_SetDig15PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig15PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRD, LED_PWMCRD_CR15_Msk, cr<<24);
}

/**
  * @brief    Get LED Dig15 PWM
  * @rmtoll   PWMCRD    CR15    FL_LED_GetDig15PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig15PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRD, LED_PWMCRD_CR15_Msk));
}

/**
  * @brief    Set LED Dig14 PWM
  * @rmtoll   PWMCRD    CR14    FL_LED_SetDig14PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig14PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRD, LED_PWMCRD_CR14_Msk, cr<<16);
}

/**
  * @brief    Get LED Dig14 PWM
  * @rmtoll   PWMCRD    CR14    FL_LED_GetDig14PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig14PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRD, LED_PWMCRD_CR14_Msk));
}

/**
  * @brief    Set LED Dig13 PWM
  * @rmtoll   PWMCRD    CR13    FL_LED_SetDig13PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig13PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRD, LED_PWMCRD_CR13_Msk, cr<<8);
}

/**
  * @brief    Get LED Dig13 PWM
  * @rmtoll   PWMCRD    CR13    FL_LED_GetDig13PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig13PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRD, LED_PWMCRD_CR13_Msk));
}

/**
  * @brief    Set LED Dig12 PWM
  * @rmtoll   PWMCRD    CR12    FL_LED_SetDig12PwmCr
  * @param    LEDx LED instance
  * @param    cr This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDig12PwmCr(LED_Type* LEDx, uint32_t cr)
{
    MODIFY_REG(LEDx->PWMCRD, LED_PWMCRD_CR12_Msk, cr<<0);
}

/**
  * @brief    Get LED Dig12 PWM
  * @rmtoll   PWMCRD    CR12    FL_LED_GetDig12PwmCr
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetDig12PwmCr(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->PWMCRD, LED_PWMCRD_CR12_Msk));
}

/**
  * @brief    Write LED Dot Data
  * @rmtoll   DOT    DATA    FL_LED_WriteDotData
  * @param    LEDx LED instance
  * @param    reg This parameter can be one of the following values:
  *           @arg @ref FL_LED_DOT_REG0
  *           @arg @ref FL_LED_DOT_REG1
  *           @arg @ref FL_LED_DOT_REG2
  *           @arg @ref FL_LED_DOT_REG3
  *           @arg @ref FL_LED_DOT_REG4
  *           @arg @ref FL_LED_DOT_REG5
  *           @arg @ref FL_LED_DOT_REG6
  *           @arg @ref FL_LED_DOT_REG7
  *           @arg @ref FL_LED_DOT_REG8
  *           @arg @ref FL_LED_DOT_REG9
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_LED_WriteDotData(LED_Type* LEDx, uint32_t reg, uint32_t data)
{
    volatile uint32_t *pData = &(LEDx->DOT0DR);
    MODIFY_REG(pData[reg], LED_DOT_DATA_Msk, data);
}

/**
  * @brief    Read LED Dot Data
  * @rmtoll   DOT    DATA    FL_LED_ReadDotData
  * @param    LEDx LED instance
  * @param    reg This parameter can be one of the following values:
  *           @arg @ref FL_LED_DOT_REG0
  *           @arg @ref FL_LED_DOT_REG1
  *           @arg @ref FL_LED_DOT_REG2
  *           @arg @ref FL_LED_DOT_REG3
  *           @arg @ref FL_LED_DOT_REG4
  *           @arg @ref FL_LED_DOT_REG5
  *           @arg @ref FL_LED_DOT_REG6
  *           @arg @ref FL_LED_DOT_REG7
  *           @arg @ref FL_LED_DOT_REG8
  *           @arg @ref FL_LED_DOT_REG9
  * @retval   
  */
__STATIC_INLINE uint32_t FL_LED_ReadDotData(LED_Type* LEDx, uint32_t reg)
{
    volatile uint32_t *pData = &(LEDx->DOT0DR);
    return (uint32_t)(READ_BIT(pData[reg], LED_DOT_DATA_Msk));
}

/**
  * @brief    Set LED Dma trig
  * @rmtoll   DMACR    DDTRIG    FL_LED_SetDmaDdtrig
  * @param    LEDx LED instance
  * @param    trig This parameter can be one of the following values:
  *           @arg @ref FL_LED_REQUEST_BY_FRAME_END
  *           @arg @ref FL_LED_REQUEST_BY_TRIG_SYNC
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDmaDdtrig(LED_Type* LEDx, uint32_t trig)
{
    MODIFY_REG(LEDx->DMACR, LED_DMACR_DDTRIG_Msk, trig);
}

/**
  * @brief    Get LED Dma trig
  * @rmtoll   DMACR    DDTRIG    FL_LED_GetDmaDdtrig
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_REQUEST_BY_FRAME_END
  *           @arg @ref FL_LED_REQUEST_BY_TRIG_SYNC
  */
__STATIC_INLINE uint32_t FL_LED_GetDmaDdtrig(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->DMACR, LED_DMACR_DDTRIG_Msk));
}

/**
  * @brief    Set Dot Dr Len
  * @rmtoll   DMACR    DOTDR_LEN    FL_LED_SetDotDrLen
  * @param    LEDx LED instance
  * @param    len This parameter can be one of the following values:
  *           @arg @ref FL_LED_DOT_DR0
  *           @arg @ref FL_LED_DOT_DR0_1
  *           @arg @ref FL_LED_DOT_DR0_2
  *           @arg @ref FL_LED_DOT_DR0_3
  *           @arg @ref FL_LED_DOT_DR0_4
  *           @arg @ref FL_LED_DOT_DR0_5
  *           @arg @ref FL_LED_DOT_DR0_6
  *           @arg @ref FL_LED_DOT_DR0_7
  *           @arg @ref FL_LED_DOT_DR0_8
  *           @arg @ref FL_LED_DOT_DR0_9
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetDotDrLen(LED_Type* LEDx, uint32_t len)
{
    MODIFY_REG(LEDx->DMACR, LED_DMACR_DOTDR_LEN_Msk, len);
}

/**
  * @brief    Get Dot Dr Len
  * @rmtoll   DMACR    DOTDR_LEN    FL_LED_GetDotDrLen
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_DOT_DR0
  *           @arg @ref FL_LED_DOT_DR0_1
  *           @arg @ref FL_LED_DOT_DR0_2
  *           @arg @ref FL_LED_DOT_DR0_3
  *           @arg @ref FL_LED_DOT_DR0_4
  *           @arg @ref FL_LED_DOT_DR0_5
  *           @arg @ref FL_LED_DOT_DR0_6
  *           @arg @ref FL_LED_DOT_DR0_7
  *           @arg @ref FL_LED_DOT_DR0_8
  *           @arg @ref FL_LED_DOT_DR0_9
  */
__STATIC_INLINE uint32_t FL_LED_GetDotDrLen(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->DMACR, LED_DMACR_DOTDR_LEN_Msk));
}

/**
  * @brief    Set Pwm Cr Len
  * @rmtoll   DMACR    DOTDR_LEN    FL_LED_SetPwmCrLen
  * @param    LEDx LED instance
  * @param    len This parameter can be one of the following values:
  *           @arg @ref FL_LED_PWM_CRA
  *           @arg @ref FL_LED_PWM_CRA_B
  *           @arg @ref FL_LED_PWM_CRA_C
  *           @arg @ref FL_LED_PWM_CRA_D
  * @retval   None
  */
__STATIC_INLINE void FL_LED_SetPwmCrLen(LED_Type* LEDx, uint32_t len)
{
    MODIFY_REG(LEDx->DMACR, LED_DMACR_PWMCR_LEN_Msk, len);
}

/**
  * @brief    Get Pwm Cr Len
  * @rmtoll   DMACR    DOTDR_LEN    FL_LED_GetPwmCrLen
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_LED_PWM_CRA
  *           @arg @ref FL_LED_PWM_CRA_B
  *           @arg @ref FL_LED_PWM_CRA_C
  *           @arg @ref FL_LED_PWM_CRA_D
  */
__STATIC_INLINE uint32_t FL_LED_GetPwmCrLen(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->DMACR, LED_DMACR_PWMCR_LEN_Msk));
}

/**
  * @brief    Set LED DMA PWM Cr Address
  * @rmtoll   DPCAR    ADDR    FL_LED_WriteDmaPwmCrAddress
  * @param    LEDx LED instance
  * @param    addr 
  * @retval   None
  */
__STATIC_INLINE void FL_LED_WriteDmaPwmCrAddress(LED_Type* LEDx, uint32_t addr)
{
    MODIFY_REG(LEDx->DPCAR, (0xffffffffU << 0U), (addr << 0U));
}

/**
  * @brief    Get LED DMA PWM Cr Address
  * @rmtoll   DPCAR    ADDR    FL_LED_ReadDmaPwmCrAddress
  * @param    LEDx LED instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_LED_ReadDmaPwmCrAddress(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->DPCAR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set LED DMA Dot Dr Address
  * @rmtoll   DDRAR    ADDR    FL_LED_WriteDmaDotDrAddress
  * @param    LEDx LED instance
  * @param    addr 
  * @retval   None
  */
__STATIC_INLINE void FL_LED_WriteDmaDotDrAddress(LED_Type* LEDx, uint32_t addr)
{
    MODIFY_REG(LEDx->DDRAR, (0xffffffffU << 0U), (addr << 0U));
}

/**
  * @brief    Get LED DMA Dot Dr Address
  * @rmtoll   DDRAR    ADDR    FL_LED_ReadDmaDotDrAddress
  * @param    LEDx LED instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_LED_ReadDmaDotDrAddress(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->DDRAR, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Get LED Current COM
  * @rmtoll   CCOM    ACT_COM    FL_LED_GetCurrentCom
  * @param    LEDx LED instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_LED_GetCurrentCom(LED_Type* LEDx)
{
    return (uint32_t)(READ_BIT(LEDx->CCOM, LED_CCOM_ACT_COM_Msk));
}

/**
  * @}
  */

/** @defgroup LED_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_LED_DeInit(LED_Type *LEDx);
FL_ErrorStatus FL_LED_Init(LED_Type *LEDx, FL_LED_InitTypeDef *initStruct);
void FL_LED_StructInit(FL_LED_InitTypeDef *initStruct);
void FL_LED_Display(uint32_t com, uint32_t dig, uint32_t state);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FL0XX_FL_LED_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-06-28*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
